###################################################################

# Created by write_sdc on Fri Jan 29 18:38:45 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF -voltage V -current uA
set_load -pin_load 5 [get_ports {out_fp[63]}]
set_load -pin_load 5 [get_ports {out_fp[62]}]
set_load -pin_load 5 [get_ports {out_fp[61]}]
set_load -pin_load 5 [get_ports {out_fp[60]}]
set_load -pin_load 5 [get_ports {out_fp[59]}]
set_load -pin_load 5 [get_ports {out_fp[58]}]
set_load -pin_load 5 [get_ports {out_fp[57]}]
set_load -pin_load 5 [get_ports {out_fp[56]}]
set_load -pin_load 5 [get_ports {out_fp[55]}]
set_load -pin_load 5 [get_ports {out_fp[54]}]
set_load -pin_load 5 [get_ports {out_fp[53]}]
set_load -pin_load 5 [get_ports {out_fp[52]}]
set_load -pin_load 5 [get_ports {out_fp[51]}]
set_load -pin_load 5 [get_ports {out_fp[50]}]
set_load -pin_load 5 [get_ports {out_fp[49]}]
set_load -pin_load 5 [get_ports {out_fp[48]}]
set_load -pin_load 5 [get_ports {out_fp[47]}]
set_load -pin_load 5 [get_ports {out_fp[46]}]
set_load -pin_load 5 [get_ports {out_fp[45]}]
set_load -pin_load 5 [get_ports {out_fp[44]}]
set_load -pin_load 5 [get_ports {out_fp[43]}]
set_load -pin_load 5 [get_ports {out_fp[42]}]
set_load -pin_load 5 [get_ports {out_fp[41]}]
set_load -pin_load 5 [get_ports {out_fp[40]}]
set_load -pin_load 5 [get_ports {out_fp[39]}]
set_load -pin_load 5 [get_ports {out_fp[38]}]
set_load -pin_load 5 [get_ports {out_fp[37]}]
set_load -pin_load 5 [get_ports {out_fp[36]}]
set_load -pin_load 5 [get_ports {out_fp[35]}]
set_load -pin_load 5 [get_ports {out_fp[34]}]
set_load -pin_load 5 [get_ports {out_fp[33]}]
set_load -pin_load 5 [get_ports {out_fp[32]}]
set_load -pin_load 5 [get_ports {out_fp[31]}]
set_load -pin_load 5 [get_ports {out_fp[30]}]
set_load -pin_load 5 [get_ports {out_fp[29]}]
set_load -pin_load 5 [get_ports {out_fp[28]}]
set_load -pin_load 5 [get_ports {out_fp[27]}]
set_load -pin_load 5 [get_ports {out_fp[26]}]
set_load -pin_load 5 [get_ports {out_fp[25]}]
set_load -pin_load 5 [get_ports {out_fp[24]}]
set_load -pin_load 5 [get_ports {out_fp[23]}]
set_load -pin_load 5 [get_ports {out_fp[22]}]
set_load -pin_load 5 [get_ports {out_fp[21]}]
set_load -pin_load 5 [get_ports {out_fp[20]}]
set_load -pin_load 5 [get_ports {out_fp[19]}]
set_load -pin_load 5 [get_ports {out_fp[18]}]
set_load -pin_load 5 [get_ports {out_fp[17]}]
set_load -pin_load 5 [get_ports {out_fp[16]}]
set_load -pin_load 5 [get_ports {out_fp[15]}]
set_load -pin_load 5 [get_ports {out_fp[14]}]
set_load -pin_load 5 [get_ports {out_fp[13]}]
set_load -pin_load 5 [get_ports {out_fp[12]}]
set_load -pin_load 5 [get_ports {out_fp[11]}]
set_load -pin_load 5 [get_ports {out_fp[10]}]
set_load -pin_load 5 [get_ports {out_fp[9]}]
set_load -pin_load 5 [get_ports {out_fp[8]}]
set_load -pin_load 5 [get_ports {out_fp[7]}]
set_load -pin_load 5 [get_ports {out_fp[6]}]
set_load -pin_load 5 [get_ports {out_fp[5]}]
set_load -pin_load 5 [get_ports {out_fp[4]}]
set_load -pin_load 5 [get_ports {out_fp[3]}]
set_load -pin_load 5 [get_ports {out_fp[2]}]
set_load -pin_load 5 [get_ports {out_fp[1]}]
set_load -pin_load 5 [get_ports {out_fp[0]}]
set_load -pin_load 5 [get_ports ready]
set_load -pin_load 5 [get_ports underflow]
set_load -pin_load 5 [get_ports overflow]
set_load -pin_load 5 [get_ports inexact]
set_load -pin_load 5 [get_ports exception]
set_load -pin_load 5 [get_ports invalid]
create_clock [get_ports clk]  -name CLK  -period 100  -waveform {0 50}
set_input_delay -clock CLK  -max 0.8  [get_ports clk]
set_input_delay -clock CLK  -max 0.8  [get_ports rst]
set_input_delay -clock CLK  -max 0.8  [get_ports enable]
set_input_delay -clock CLK  -max 0.8  [get_ports {rmode[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {rmode[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {fpu_op[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {fpu_op[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {fpu_op[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[63]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[62]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[61]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[60]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[59]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[58]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[57]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[56]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[55]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[54]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[53]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[52]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[51]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[50]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[49]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[48]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[47]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[46]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[45]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[44]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[43]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[42]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[41]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[40]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[39]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[38]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[37]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[36]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[35]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[34]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[33]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[32]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opa[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[63]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[62]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[61]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[60]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[59]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[58]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[57]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[56]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[55]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[54]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[53]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[52]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[51]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[50]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[49]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[48]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[47]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[46]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[45]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[44]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[43]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[42]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[41]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[40]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[39]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[38]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[37]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[36]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[35]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[34]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[33]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[32]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {opb[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[63]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[62]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[61]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[60]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[59]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[58]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[57]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[56]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[55]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[54]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[53]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[52]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[51]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[50]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[49]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[48]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[47]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[46]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[45]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[44]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[43]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[42]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[41]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[40]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[39]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[38]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[37]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[36]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[35]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[34]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[33]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[32]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {out_fp[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports ready]
set_output_delay -clock CLK  -max 0.8  [get_ports underflow]
set_output_delay -clock CLK  -max 0.8  [get_ports overflow]
set_output_delay -clock CLK  -max 0.8  [get_ports inexact]
set_output_delay -clock CLK  -max 0.8  [get_ports exception]
set_output_delay -clock CLK  -max 0.8  [get_ports invalid]
set_input_transition -max 1  [get_ports clk]
set_input_transition -max 1  [get_ports rst]
set_input_transition -max 1  [get_ports enable]
set_input_transition -max 1  [get_ports {rmode[1]}]
set_input_transition -max 1  [get_ports {rmode[0]}]
set_input_transition -max 1  [get_ports {fpu_op[2]}]
set_input_transition -max 1  [get_ports {fpu_op[1]}]
set_input_transition -max 1  [get_ports {fpu_op[0]}]
set_input_transition -max 1  [get_ports {opa[63]}]
set_input_transition -max 1  [get_ports {opa[62]}]
set_input_transition -max 1  [get_ports {opa[61]}]
set_input_transition -max 1  [get_ports {opa[60]}]
set_input_transition -max 1  [get_ports {opa[59]}]
set_input_transition -max 1  [get_ports {opa[58]}]
set_input_transition -max 1  [get_ports {opa[57]}]
set_input_transition -max 1  [get_ports {opa[56]}]
set_input_transition -max 1  [get_ports {opa[55]}]
set_input_transition -max 1  [get_ports {opa[54]}]
set_input_transition -max 1  [get_ports {opa[53]}]
set_input_transition -max 1  [get_ports {opa[52]}]
set_input_transition -max 1  [get_ports {opa[51]}]
set_input_transition -max 1  [get_ports {opa[50]}]
set_input_transition -max 1  [get_ports {opa[49]}]
set_input_transition -max 1  [get_ports {opa[48]}]
set_input_transition -max 1  [get_ports {opa[47]}]
set_input_transition -max 1  [get_ports {opa[46]}]
set_input_transition -max 1  [get_ports {opa[45]}]
set_input_transition -max 1  [get_ports {opa[44]}]
set_input_transition -max 1  [get_ports {opa[43]}]
set_input_transition -max 1  [get_ports {opa[42]}]
set_input_transition -max 1  [get_ports {opa[41]}]
set_input_transition -max 1  [get_ports {opa[40]}]
set_input_transition -max 1  [get_ports {opa[39]}]
set_input_transition -max 1  [get_ports {opa[38]}]
set_input_transition -max 1  [get_ports {opa[37]}]
set_input_transition -max 1  [get_ports {opa[36]}]
set_input_transition -max 1  [get_ports {opa[35]}]
set_input_transition -max 1  [get_ports {opa[34]}]
set_input_transition -max 1  [get_ports {opa[33]}]
set_input_transition -max 1  [get_ports {opa[32]}]
set_input_transition -max 1  [get_ports {opa[31]}]
set_input_transition -max 1  [get_ports {opa[30]}]
set_input_transition -max 1  [get_ports {opa[29]}]
set_input_transition -max 1  [get_ports {opa[28]}]
set_input_transition -max 1  [get_ports {opa[27]}]
set_input_transition -max 1  [get_ports {opa[26]}]
set_input_transition -max 1  [get_ports {opa[25]}]
set_input_transition -max 1  [get_ports {opa[24]}]
set_input_transition -max 1  [get_ports {opa[23]}]
set_input_transition -max 1  [get_ports {opa[22]}]
set_input_transition -max 1  [get_ports {opa[21]}]
set_input_transition -max 1  [get_ports {opa[20]}]
set_input_transition -max 1  [get_ports {opa[19]}]
set_input_transition -max 1  [get_ports {opa[18]}]
set_input_transition -max 1  [get_ports {opa[17]}]
set_input_transition -max 1  [get_ports {opa[16]}]
set_input_transition -max 1  [get_ports {opa[15]}]
set_input_transition -max 1  [get_ports {opa[14]}]
set_input_transition -max 1  [get_ports {opa[13]}]
set_input_transition -max 1  [get_ports {opa[12]}]
set_input_transition -max 1  [get_ports {opa[11]}]
set_input_transition -max 1  [get_ports {opa[10]}]
set_input_transition -max 1  [get_ports {opa[9]}]
set_input_transition -max 1  [get_ports {opa[8]}]
set_input_transition -max 1  [get_ports {opa[7]}]
set_input_transition -max 1  [get_ports {opa[6]}]
set_input_transition -max 1  [get_ports {opa[5]}]
set_input_transition -max 1  [get_ports {opa[4]}]
set_input_transition -max 1  [get_ports {opa[3]}]
set_input_transition -max 1  [get_ports {opa[2]}]
set_input_transition -max 1  [get_ports {opa[1]}]
set_input_transition -max 1  [get_ports {opa[0]}]
set_input_transition -max 1  [get_ports {opb[63]}]
set_input_transition -max 1  [get_ports {opb[62]}]
set_input_transition -max 1  [get_ports {opb[61]}]
set_input_transition -max 1  [get_ports {opb[60]}]
set_input_transition -max 1  [get_ports {opb[59]}]
set_input_transition -max 1  [get_ports {opb[58]}]
set_input_transition -max 1  [get_ports {opb[57]}]
set_input_transition -max 1  [get_ports {opb[56]}]
set_input_transition -max 1  [get_ports {opb[55]}]
set_input_transition -max 1  [get_ports {opb[54]}]
set_input_transition -max 1  [get_ports {opb[53]}]
set_input_transition -max 1  [get_ports {opb[52]}]
set_input_transition -max 1  [get_ports {opb[51]}]
set_input_transition -max 1  [get_ports {opb[50]}]
set_input_transition -max 1  [get_ports {opb[49]}]
set_input_transition -max 1  [get_ports {opb[48]}]
set_input_transition -max 1  [get_ports {opb[47]}]
set_input_transition -max 1  [get_ports {opb[46]}]
set_input_transition -max 1  [get_ports {opb[45]}]
set_input_transition -max 1  [get_ports {opb[44]}]
set_input_transition -max 1  [get_ports {opb[43]}]
set_input_transition -max 1  [get_ports {opb[42]}]
set_input_transition -max 1  [get_ports {opb[41]}]
set_input_transition -max 1  [get_ports {opb[40]}]
set_input_transition -max 1  [get_ports {opb[39]}]
set_input_transition -max 1  [get_ports {opb[38]}]
set_input_transition -max 1  [get_ports {opb[37]}]
set_input_transition -max 1  [get_ports {opb[36]}]
set_input_transition -max 1  [get_ports {opb[35]}]
set_input_transition -max 1  [get_ports {opb[34]}]
set_input_transition -max 1  [get_ports {opb[33]}]
set_input_transition -max 1  [get_ports {opb[32]}]
set_input_transition -max 1  [get_ports {opb[31]}]
set_input_transition -max 1  [get_ports {opb[30]}]
set_input_transition -max 1  [get_ports {opb[29]}]
set_input_transition -max 1  [get_ports {opb[28]}]
set_input_transition -max 1  [get_ports {opb[27]}]
set_input_transition -max 1  [get_ports {opb[26]}]
set_input_transition -max 1  [get_ports {opb[25]}]
set_input_transition -max 1  [get_ports {opb[24]}]
set_input_transition -max 1  [get_ports {opb[23]}]
set_input_transition -max 1  [get_ports {opb[22]}]
set_input_transition -max 1  [get_ports {opb[21]}]
set_input_transition -max 1  [get_ports {opb[20]}]
set_input_transition -max 1  [get_ports {opb[19]}]
set_input_transition -max 1  [get_ports {opb[18]}]
set_input_transition -max 1  [get_ports {opb[17]}]
set_input_transition -max 1  [get_ports {opb[16]}]
set_input_transition -max 1  [get_ports {opb[15]}]
set_input_transition -max 1  [get_ports {opb[14]}]
set_input_transition -max 1  [get_ports {opb[13]}]
set_input_transition -max 1  [get_ports {opb[12]}]
set_input_transition -max 1  [get_ports {opb[11]}]
set_input_transition -max 1  [get_ports {opb[10]}]
set_input_transition -max 1  [get_ports {opb[9]}]
set_input_transition -max 1  [get_ports {opb[8]}]
set_input_transition -max 1  [get_ports {opb[7]}]
set_input_transition -max 1  [get_ports {opb[6]}]
set_input_transition -max 1  [get_ports {opb[5]}]
set_input_transition -max 1  [get_ports {opb[4]}]
set_input_transition -max 1  [get_ports {opb[3]}]
set_input_transition -max 1  [get_ports {opb[2]}]
set_input_transition -max 1  [get_ports {opb[1]}]
set_input_transition -max 1  [get_ports {opb[0]}]
